content/blog/kubernetes-native-phoenix-apps-part-1.md
+++
title = "Kubernetes Native Phoenix Apps: Part 1"
author = ["Shane Sveller"]
date = 2018-10-28T14:15:00-05:00
lastmod = 2018-10-28T14:34:23-05:00
tags = ["docker", "elixir", "phoenix", "umbrella", "kubernetes"]
categories = ["elixir"]
draft = false
+++

As described in the introductory post, this article will briefly outline
the installation of Distillery 2 as well as including a deeper philosophical
and technical explanation of how I structure multi-stage Docker images for
Elixir/Phoenix applications.

<!--more-->

Published articles in this series:

-   [Introduction](/blog/2018/10/28/kubernetes-native-phoenix-apps-introduction/)
-   Part 1 (this post)


## Our Application {#our-application}

The [application](https://github.com/shanesveller/kube-native-phoenix) we're going to be working with throughout this series was
created as follows:

-   Phoenix 1.4 (RC2 at the time of writing)
-   Umbrella application
-   Using default components (Ecto, Postgres, Webpack)

Its actual content and functionality will intentionally be kept very
sparse, other than to demonstrate certain common scenarios, such as native
dependencies of well-known Hex packages.


## Installing Distillery 2 {#installing-distillery-2}

Generally speaking, we'll closely follow the existing Distillery 2
[installation guide](https://hexdocs.pm/distillery/introduction/installation.html). Paul and the other contributors have produced very
high-quality documentation as part of the 2.x release cycle. I'll call
specific attention to a few sections of these guides:

-   [Installation guide](https://hexdocs.pm/distillery/introduction/installation.html)
-   [Walkthrough](https://hexdocs.pm/distillery/introduction/walkthrough.html)
-   [Umbrella Projects](https://hexdocs.pm/distillery/introduction/umbrella%5Fprojects.html)
-   [Phoenix guide](https://hexdocs.pm/distillery/guides/phoenix%5Fwalkthrough.html)
-   [Deploying with Docker](https://hexdocs.pm/distillery/guides/working%5Fwith%5Fdocker.html)

The last guide is perhaps where we will diverge the most from the upstream
documentation. As I mentioned previously, this blog series will present an
opinionated and optimized experience, so we're going to make a few
different choices in how to structure our Docker image.

Before continuing, please make sure that you have completed the
installation of Distillery within your application, and that you can
successfully run `mix release` and get a working application.

For an example of what this looks like in our live application, please see
the git tree at commits `4b2e2cb..aa6c54e` [here](https://github.com/shanesveller/kube-native-phoenix/compare/4b2e2cb...aa6c54e).


## Creating our first Docker image {#creating-our-first-docker-image}

While there are many options and many opinions on how to construct an
optimal Docker image, here are my personal recommended priorities:

-   Strict compatibility with vanilla `docker build` commands on a recent
    version of the Docker daemon (~17.05+), which implies compatibility with
    a broad variety of CI/CD tools and environments
-   Smallest reasonable resulting image, achieved primarily through
    multi-stage builds and intentional choice of base images
-   High cache hit rate during iterative builds
-   No mixing of runtimes in build stages, i.e. no adding Node.js to an
    Elixir base image
-   Alpine Linux-based, with a pivot to the `-slim` images when absolutely
    necessary
-   Final image should have minimal system-level packages installed and rely
    on Distillery's ability to package the Erlang runtime system with a
    release


### Dockerfile {#dockerfile}

As mentioned, we're targeting `docker build` compatibility rather than one
of the other, possibly more sophisticated approaches.

Let's see the complete file first and then walk through it together in
small steps.

{{< highlight dockerfile "linenos=table, linenostart=1" >}}
# docker build -t kube_native:builder --target=builder .
FROM elixir:1.7.3-alpine as builder
RUN apk add --no-cache \
    gcc \
    git \
    make \
    musl-dev
RUN mix local.rebar --force && \
    mix local.hex --force
WORKDIR /app
ENV MIX_ENV=prod

# docker build -t kube_native:deps --target=deps .
FROM builder as deps
COPY mix.* /app/
# Explicit list of umbrella apps
RUN mkdir -p \
    /app/apps/kube_native \
    /app/apps/kube_native_web
COPY apps/kube_native/mix.* /app/apps/kube_native/
COPY apps/kube_native_web/mix.* /app/apps/kube_native_web/
RUN mix do deps.get --only prod, deps.compile

# docker build -t kube_native:frontend --target=frontend .
FROM node:10.12-alpine as frontend
WORKDIR /app
COPY apps/kube_native_web/assets/package*.json /app/
COPY --from=deps /app/deps/phoenix /deps/phoenix
COPY --from=deps /app/deps/phoenix_html /deps/phoenix_html
RUN npm ci
COPY apps/kube_native_web/assets /app
RUN npm run deploy

# docker build -t kube_native:releaser --target=releaser .
FROM deps as releaser
COPY . /app/
COPY --from=frontend /priv/static apps/kube_native_web/priv/static
RUN mix do phx.digest, release --env=prod --no-tar

# docker run -it --rm elixir:1.7.3-alpine sh -c 'head -n1 /etc/issue'
FROM alpine:3.8 as runner
RUN addgroup -g 1000 kube_native && \
    adduser -D -h /app \
      -G kube_native \
      -u 1000 \
      kube_native
RUN apk add -U bash libssl1.0
USER kube_native
WORKDIR /app
COPY --from=releaser /app/_build/prod/rel/kube_native_umbrella /app
EXPOSE 4000
ENTRYPOINT ["/app/bin/kube_native_umbrella"]
CMD ["foreground"]
{{< /highlight >}}

Code samples are described by their preceding text below.
