blog.org
****** Build environment

       First, we prepare a build stage named ~builder~ with the basic
       prerequisites of an Elixir development environment, including some fairly
       universally-required tooling for native extensions. This is where we'll
       insert any additional development packages needed to compile certain Hex
       dependencies in the future.

       Note also that we don't get Hex or Rebar automatically installed with
       this base image, and need to trigger those installations ourselves.

       Finally, we'll be building our project inside the ~/app~ working
       directory and defaulting to the ~prod~ Mix environment during Hex package
       compilation. *This image is not intended for development purposes
       whatsoever* and is fairly unsuitable for that use-case.

       #+BEGIN_SRC dockerfile -n 2
         FROM elixir:1.7.3-alpine as builder
         RUN apk add --no-cache \
             gcc \
             git \
             make \
             musl-dev
         RUN mix local.rebar --force && \
             mix local.hex --force
         WORKDIR /app
         ENV MIX_ENV=prod
       #+END_SRC

       I'm using a specific tagged Elixir release here, targeting the ~-alpine~
       variant to build on top of Alpine Linux. The maintainers of this
       "official" Docker image are not affiliated with Plataformatec or Erlang
       Solutions, and one downside of this image stream is that they treat
       certain tags as mutable.

       At different calendar dates, the ~1.7.3-alpine~ image tag has included
       differing versions of the underlying Erlang runtime. One way to hedge
       against this would be to be more precise in our FROM line:

       #+BEGIN_SRC dockerfile
         FROM elixir:1.7.3-alpine@sha256:4eb30b05d0acc9e8821dde339f0e199ae616e0e9921fd84822c23fe6b1f81b6d
       #+END_SRC

       You can determine the digest to include by running ~docker images
       --digests elixir~.

       While it would be totally valid to install and compile both Erlang and
       Elixir from source during this build phase, I do not consider this to be
       at all necessary or a particularly valuable effort for most companies or
       scenarios. Doing so requires you to absorb the maintenance burden of
       "keeping up with the Joneses" and incorporating any necessary security
       patches yourself, tracking the current release versions, and
       understanding their own build-time dependencies.

       If you find yourself with a requirement that cannot be satisfied under
       Alpine Linux, or feel an anti-affinity for Alpine, or an affinity for
       Debian, using a ~-slim~ base image variant will be largely identical to
       this process. Start with replacing ~apk~ commands with their semantic
       equivalent using ~apt-get~ (because ~apt~ makes no stability guarantees
       about its input/output). You'll potentially have broader compatibility
       with some corners of the software industry, at the cost of a slightly
       larger runtime image.

****** Hex Dependencies

       Next we acquire and compile all known Hex dependencies. This slightly
       verbose layering structure allows us to get a very high cache hit rate
       during Docker builds, because our dependencies are some of the slowest
       and least-frequently changing portions of our application development
       work.

       Note here that for an umbrella application, we also need to descend into
       each umbrella app and include its ~mix.exs~ content as well. In a
       non-umbrella application, it's likely sufficient to only include the
       highlighted lines.

       Lines 17-21 are an unfortunate necessity for Umbrella applications, as
       the ~COPY~ directive for Dockerfiles doesn't support multiple
       destinations per the [[https://docs.docker.com/engine/reference/builder/#copy][documentation]], only multiple sources. As you add
       more applications to your umbrella, new lines will need to be added here.
       (I'm working on a Mix task library that will embody this and other
       operational knowledge, which will be released to Hex in the coming
       weeks.)

       Now, this seems like an awful lot of ceremony, doesn't it? Here's the
       payoff: without a technique that is similar to this in spirit,
       application-level changes such as new behavior in a Phoenix controller or
       new markup in a view template will *bust the Docker build cache* and
       require all of the Hex dependencies to be downloaded and compiled anew.

       This is a very common pattern across many programming languages when
       creating Docker images, not just Elixir, so I'm satisfied with including
       it here. You'll also see it again in the next section.

       #+BEGIN_SRC dockerfile +n 2 :hl_lines 1-3,10
         # docker build -t kube_native:deps --target=deps .
         FROM builder as deps
         COPY mix.* /app/
         # Explicit list of umbrella apps
         RUN mkdir -p \
           /app/apps/kube_native \
           /app/apps/kube_native_web
         COPY apps/kube_native/mix.* /app/apps/kube_native/
         COPY apps/kube_native_web/mix.* /app/apps/kube_native_web/
         RUN mix do deps.get --only prod, deps.compile
       #+END_SRC

****** NPM/Asset Dependencies

       Similar to how we constructed the ~deps~ phase just above, we're pulling
       in a language-specific but otherwise unadorned base image to do the heavy
       lifting, as I don't wish to maintain or even be particularly
       familiar with packing Node when it's not a *runtime* dependency.

       We grab the *package.json* and *package-lock.json* files from our project
       to describe our JavaScript-ecosystem dependencies, and also bundle in the
       Javascript assets that are included with our previously-acquired Hex
       packages. Following that, we use the somewhat-recent ~npm ci~ command,
       which is optimal for the scenario where we're not looking to upgrade or
       otherwise change our JS dependencies, merely reproduce them as-is.

       After the NPM dependency tree is resolved, we pull in the rest of our
       locally-authored frontend content and then use an NPM task to run a
       production-friendly Webpack build of our assets.

       #+BEGIN_SRC dockerfile +n 2
         # docker build -t kube_native:frontend --target=frontend .
         FROM node:10.12-alpine as frontend
         WORKDIR /app
         COPY apps/kube_native_web/assets/package*.json /app/
         COPY --from=deps /app/deps/phoenix /deps/phoenix
         COPY --from=deps /app/deps/phoenix_html /deps/phoenix_html
         RUN npm ci
         COPY apps/kube_native_web/assets /app
         RUN npm run deploy
       #+END_SRC

****** Compile release

       Now it's time to tie all of this together into a Distillery release! We
       pull in our Elixir dependencies from the previous phase as our new base
       image, and then include only the compiled assets from the Node stage in
       our ~/priv/static~ directory. ~mix phx.digest~ takes those in and
       fingerprints them, and then finally we run ~mix release~ to build our
       package without ~tar~ring it up, as we'd just have to unpack again in the
       next and final stage.

       #+BEGIN_SRC dockerfile +n 2
         # docker build -t kube_native:releaser --target=releaser .
         FROM deps as releaser
         COPY . /app/
         COPY --from=frontend /priv/static apps/kube_native_web/priv/static
         RUN mix do phx.digest, release --env=prod --no-tar
       #+END_SRC

