blog.org
****** Build runtime image

       Here's how we achieve our minimal runtime image sizes. At the time of
       writing, the previous stage produces a Docker image weighing at about
       240MB, and with 20 separate image layers. For our final image, we start
       over from a compatible release of Alpine Linux. It's a strong
       recommendation that whenever possible, we not run containerized processes
       as the root user within the image, so we create a static group and user
       for this application, each with ID ~1000~, and switch to that user. The
       particular number likely will not matter up until the point that you need
       to reconcile file ownership across Docker volumes or between host and
       container.

       We pull in the uncompressed release built in the previous stage, expose
       the default Phoenix port, and set our ~ENTRYPOINT~ to launch the script
       provided by Distillery. The ~CMD~ directive tells the image that by
       default it should launch the application in the foreground without
       interactivity.

       We'll see later in the series that this opens up the opportunity to run
       custom commands more easily within our image, specified at runtime,
       without altering the image.

       #+BEGIN_SRC dockerfile +n 2
         # docker run -it --rm elixir:1.7.3-alpine sh -c 'head -n1 /etc/issue'
         FROM alpine:3.8 as runner
         RUN addgroup -g 1000 kube_native && \
             adduser -D -h /app \
               -G kube_native \
               -u 1000 \
               kube_native
         RUN apk add -U bash libssl1.0
         USER kube_native
         WORKDIR /app
         COPY --from=releaser /app/_build/prod/rel/kube_native_umbrella /app
         EXPOSE 4000
         ENTRYPOINT ["/app/bin/kube_native_umbrella"]
         CMD ["foreground"]
       #+END_SRC

***** Dockerignore

     We'll continue the process of Dockerizing this Phoenix application with an
     oft-forgotten step: the ~.dockerignore~ file. This file will feel similar to
     the syntax of a ~.gitignore~ file, but does not intentionally mimic its
     structure [[https://docs.docker.com/engine/reference/builder/#dockerignore-file][as documented by Docker]].

     We can start ourselves on good footing by copying the existing ~.gitignore~
     provided by the ~phx.new~ task when we started our project:

     #+BEGIN_SRC shell
       echo '# Default gitignore content' > .dockerignore
       cat .gitignore >> .dockerignore
     #+END_SRC

     And next we'll customize it for our needs by adding the following content:

     #+BEGIN_SRC gitignore -n :hl_lines 2,6,8,11-14
       # Developer tools
       .git
       .tool-versions

       # Umbrella structure
       apps/**/config/*.secret.exs
       apps/**/node_modules
       apps/**/priv/cert
       apps/**/priv/static

       # Docker
       .dockerignore
       Dockerfile
       docker-compose.yml
     #+END_SRC

     The value in a well-formed ~.dockerignore~ file is two-fold in my eyes. It
     prevents local content that shouldn't be persisted from appearing in Docker
     images that were built locally, such as secrets, tooling/editor artifacts,
     or compiled content like our static assets. (We're just going to recompile
     those in a build stage, anyway!) It also minimizes the local changes that
     will contribute to a cache miss when building updated versions of an
     existing Docker image.

     The logic here is fairly subjective, but I feel that the following tasks
     should not /inherently/ cause a fresh image build:

     - Git commits persisting your changes, without other filesystem changes
       (line 2)
     - Non-semantic changes to how we define the Dockerfile, such as whitespace
       or comments (lines 12-13)
       - Docker will automatically cache-bust for us if the changes are meaningful
     - Changes to a Docker Compose environment definition (line 14)
     - Changes to development-only or gitignored secrets files (lines 6, 8)

***** Caveats

      This approach comes with a lot of benefits, but it was at least one
      significant drawback - "cold" builds, that don't have applicable caches
      present, are just as slow as a single-stage linear approach. Thankfully,
      this can be mitigated via workflow changes.

      If you build your images with this command or similar, you'll notice that
      you also get some "dangling" images on your Docker host:

      #+BEGIN_SRC shell
        docker build -t kube_native:$git_sha .
      #+END_SRC

      These images are ephemeral outputs of the stages of our build, and can be
      intentionally captured as a differently-tagged image. One thing this
      avoids, other than ambiguity in ~docker images~ command output, is that
      these images would then no longer be cleared by mechanisms like ~docker
      system prune~, without the ~-a~ flag.

      These preliminary stage images could even be pushed to the same Docker
      image registry that your runtime image goes to, so that multiple
      developers can share the existing cached work without repeating it until
      necessary.

      There were comments throughout the above Dockerfile section, but here's
      the alternate workflow I'm proposing:
      #+BEGIN_SRC shell
        docker build -t kube_native:builder --target=builder .
        docker build -t kube_native:deps --target=deps .
        docker build -t kube_native:frontend --target=frontend .
        docker build -t kube_native:releaser --target=releaser .
        docker build -t kube_native:$git_sha .
        docker tag kube_native:builder my.registry.com/kube_native:builder
        docker push my.registry.com/kube_native:builder
        docker tag kube_native:deps my.registry.com/kube_native:deps
        docker push my.registry.com/kube_native:deps
        # ...
        docker push my.registry.com/kube_native:$git_sha
      #+END_SRC

      This is verbose, but precise, and ripe for automation via Makefile, Mix
      tasks, etc. You can also introduce a growing list of ~--cache-from~ flags
      to the above commands to specify what images are considered "upstream" of
      a given target.

      Other developers, and your CI/CD systems, can first ~docker pull~ the
      above tagged images to speed up their local builds. Anecdotally, I saw
      Google Cloud Builder save around 2/3 of my build time by following this
      technique.

**** Code Checkpoint

     The work presented in this post is reflected in git commit ~d239377~ or tag
     ~part-1-end~ available [[https://github.com/shanesveller/kube-native-phoenix/tree/part-1-end][here]]. You can compare these changes to the initial
     commit [[https://github.com/shanesveller/kube-native-phoenix/compare/part-1-start...part-1-end][here]].

**** Appendix

***** Software/Tool Versions
      | Software   |    Version |
      |------------+------------|
      | Distillery |     2.0.10 |
      | Docker     | 18.06.1-ce |
      | Elixir     |      1.7.3 |
      | Erlang     |     21.1.1 |
      | Phoenix    |   1.4-rc.2 |

***** Identifying Alpine base release

      #+BEGIN_SRC shell
        docker run -it --rm elixir:1.7.3-alpine sh -c 'head -n1 /etc/issue'
      #+END_SRC

